Revit 2027 API
ParameterAccess.ListParameters Method
Overload List
Name | Description
ListParameters(ElementId) |  Retrieves all of the parameters, including extended properties, that are applicable to the element specified by the given id.
ListParameters(LinkElementId) |  Retrieves all of the parameters, including extended properties, that are applicable to the element specified by the given id.
Top
See Also
Reference
ParameterAccess Class
Autodesk.Revit.DB Namespace